# merge

In [205]:
import pandas as  pd
import numpy as np

In [206]:
df1 = pd .DataFrame([[1,2,3],[2,7,3],[6,3,9]],columns=['A','B','C'])

In [207]:
df1

   A  B  C
0  1  2  3
1  2  7  3
2  6  3  9

In [223]:
df2 = pd.DataFrame([[11,7,323],[22,2,35],[63,32,91]],columns=['X','Y','Z'])

In [224]:
df2

    X   Y    Z
0  11   7  323
1  22   2   35
2  63  32   91

In [225]:
df3 = pd.merge (df1, df2, right_on = "Y",left_on = "B")

In [227]:
df3

   A  B  C   X  Y    Z
0  1  2  3  22  2   35
1  2  7  3  11  7  323

# concat

In [278]:
s1 = pd.Series(['a','b'])
s2 = pd.Series(['c','d'])
pd.concat([s1,s2])

0    a
1    b
0    c
1    d
dtype: object

In [279]:
s1 = pd.Series([1,2,3],[5,4,8])
s2 = pd.Series([10,11,12],[12,14,15])
pd.concat([s1,s2])

5      1
4      2
8      3
12    10
14    11
15    12
dtype: int64

In [10]:
s1 = pd.Series([2,4,2],[12,11,14])
s2 = pd.Series([1,2,3],[4,5,6])
pd.concat([s1,s2])

12    2
11    4
14    2
4     1
5     2
6     3
dtype: int64

In [11]:



df1 =pd.DataFrame([['a',1],['b',2]],columns=['letter','number'])
df1

  letter  number
0      a       1
1      b       2

In [12]:
df2 = pd.DataFrame([['c',2],['d',6]],columns=['letter','number'])

In [13]:
df2

  letter  number
0      c       2
1      d       6

In [14]:
pd.concat([df1,df2])

  letter  number
0      a       1
1      b       2
0      c       2
1      d       6

In [15]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    
    index=[0, 1, 2, 3],
)

In [17]:
df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)

In [18]:
df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

In [20]:
df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

In [21]:
frames = [df1, df2, df3]

In [22]:
result = pd.concat(frames)

In [23]:
print(result)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [40]:
df1 = pd.Series([22,23,14],[1,2,3])

In [41]:
df2 = pd.Series([1,2,2],[44,5,6])

In [42]:
frames = df1,df2

In [44]:
result = pd.concat(frames)

In [45]:
print(result)

1     22
2     23
3     14
44     1
5      2
6      2
dtype: int64

In [56]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    
    index=[0, 1, 2, 3],
)

In [57]:
df4 = pd.DataFrame(
    {
        "B": ["B2", "B3", "B6", "B7"],
        "D": ["D2", "D3", "D6", "D7"],
        "F": ["F2", "F3", "F6", "F7"],
    },
    index=[2, 3, 6, 7],
)

In [60]:
result = pd.concat([df1, df4], axis=1)

In [61]:
print(result)

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [271]:
result1 = pd.concat([df1, df4], axis=1, join="inner")

In [273]:
result1

   A  B  C   B   D   F
2  6  3  9  B2  D2  F2

In [274]:
result = pd.concat([df1,df4],axis=1,join="outer")

In [275]:
result

     A    B    C    B    D    F
0  1.0  2.0  3.0  NaN  NaN  NaN
1  2.0  7.0  3.0  NaN  NaN  NaN
2  6.0  3.0  9.0   B2   D2   F2
3  NaN  NaN  NaN   B3   D3   F3
6  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN   B7   D7   F7

In [68]:
result = pd.concat([df1, df4], axis=1).reindex(df4.index)

In [69]:
print(result)

     A    B    C    D   B   D   F
2   A2   B2   C2   D2  B2  D2  F2
3   A3   B3   C3   D3  B3  D3  F3
6  NaN  NaN  NaN  NaN  B6  D6  F6
7  NaN  NaN  NaN  NaN  B7  D7  F7

In [74]:
result = pd.concat([df1, df4], ignore_index=True, sort=False)

In [75]:
print(result)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [91]:
s11 = pd.Series(["X0", "X1", "X2", "X3"], name="X")

result = pd.concat([df1, s11], axis=1)

In [84]:
print(result)

    A   B   C   D   X
0  A0  B0  C0  D0  X0
1  A1  B1  C1  D1  X1
2  A2  B2  C2  D2  X2
3  A3  B3  C3  D3  X3

In [286]:
pd.concat([s1, s2], axis=1, keys=[ "blue", "yellow"])

    blue  yellow
5    1.0     NaN
4    2.0     NaN
8    3.0     NaN
12   NaN    10.0
14   NaN    11.0
15   NaN    12.0

In [287]:
pd.concat([s1,s2],axis =1 ,keys=["red","grey"])

    red  grey
5   1.0   NaN
4   2.0   NaN
8   3.0   NaN
12  NaN  10.0
14  NaN  11.0
15  NaN  12.0

In [288]:
pieces = {"x": df1, "y": df2, "z": df3}

result = pd.concat(pieces)

In [102]:
print(result)

        A    B    C    D    0
x 0    A0   B0   C0   D0  NaN
  1    A1   B1   C1   D1  NaN
  2    A2   B2   C2   D2  NaN
  3    A3   B3   C3   D3  NaN
y 44  NaN  NaN  NaN  NaN  1.0
  5   NaN  NaN  NaN  NaN  2.0
  6   NaN  NaN  NaN  NaN  2.0
z 8    A8   B8   C8   D8  NaN
  9    A9   B9   C9   D9  NaN
  10  A10  B10  C10  D10  NaN
  11  A11  B11  C11  D11  NaN

In [103]:
result = pd.concat(
    pieces, keys=["x", "y", "z"], levels=[["z", "y", "x", "w"]], names=["group_key"]
)

In [104]:
print(result)

                A    B    C    D    0
group_key
x         0    A0   B0   C0   D0  NaN
          1    A1   B1   C1   D1  NaN
          2    A2   B2   C2   D2  NaN
          3    A3   B3   C3   D3  NaN
y         44  NaN  NaN  NaN  NaN  1.0
          5   NaN  NaN  NaN  NaN  2.0
          6   NaN  NaN  NaN  NaN  2.0
z         8    A8   B8   C8   D8  NaN
          9    A9   B9   C9   D9  NaN
          10  A10  B10  C10  D10  NaN
          11  A11  B11  C11  D11  NaN

# merge

In [124]:
left = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)

In [125]:
right = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

In [126]:
result = pd.merge(left, right, on="key")

In [123]:
print(result)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [281]:
left1 = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)

In [282]:
right2 = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)

In [284]:
result = pd.merge(left1,right2,on = ["key1", "key2"])

In [285]:
result

  key1 key2 A_x B_x A_y B_y
0   K0   K0  A0  B0  A0  B0
1   K0   K1  A1  B1  A1  B1
2   K1   K0  A2  B2  A2  B2
3   K2   K1  A3  B3  A3  B3

In [242]:
left = pd.DataFrame({"A": [1, 2], "B": [2, 2]})

right = pd.DataFrame({"A": [4, 5, 6], "B": [2, 2, 2]})

result = pd.merge(left, right, on="B", how="outer")

In [233]:
print(result)

   A_x  B  A_y
0    1  2    4
1    1  2    5
2    1  2    6
3    2  2    4
4    2  2    5
5    2  2    6

In [246]:
result = pd.merge(left,right)

In [247]:
print(result)

Empty DataFrame
Columns: [A, B]
Index: []

In [252]:
left = pd.DataFrame({"key": [1,22,23], "v1": [10,11,15]})
left

   key  v1
0    1  10
1   22  11
2   23  15

In [253]:
right = pd.DataFrame({"key":[2,4,24],"v2":[20,21,52]})
right

   key  v2
0    2  20
1    4  21
2   24  52

In [254]:
eft = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "key": ["K0", "K1", "K0", "K1"],
    }
)

In [261]:
right = pd.DataFrame({"C": ["C0", "C1"], "D": ["D0", "D1"]}, index=["K0", "K1"])

In [262]:
print(right)

     C   D
K0  C0  D0
K1  C1  D1

In [263]:
print(left)

   key  v1
0    1  10
1   22  11
2   23  15

# Transform

In [290]:
df = pd.DataFrame({
    'grade':['A','B','C','D'],
    'y':[3,2,4,5,]
})

In [291]:
df

  grade  y
0     A  3
1     B  2
2     C  4
3     D  5

In [305]:
g= df.groupby("grade")

In [308]:
g.__dir__()

['__annotations__',
 '__class__',
 '__class_getitem__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__orig_bases__',
 '__parameters__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__slots__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_accessors',
 '_agg_examples_doc',
 '_agg_general',
 '_agg_py_fallback',
 '_aggregate_frame',
 '_aggregate_item_by_item',
 '_aggregate_with_numba',
 '_apply_allowlist',
 '_apply_filter',
 '_apply_to_column_groupbys',
 '_ascending_count',
 '_bool_agg',
 '_can_use_transform_fast',
 '_choose_path',
 '_concat_objects',
 '_constructor',
 '_cumcount_array',
 '_cython_agg_general',
 '_cython_transform',
 '_define_paths',
 '_descending_count',
 '_dir_additions',
 '_dir_deletions',
 '_fill',
 '_get_cythonized_result',
 '_get_data_to_aggregate',
 '_get_index',
 '_get_indices',
 '_gotitem',
 '_group_selection',
 '_group_selection_context',
 '_hidden_attrs',
 '_indexed_output_to_ndframe',
 '_insert_inaxis_grouper_inplace',
 '_internal_names',
 '_internal_names_set',
 '_is_protocol',
 '_iterate_column_groupbys',
 '_iterate_slices',
 '_make_mask_from_int',
 '_make_mask_from_list',
 '_make_mask_from_positional_indexer',
 '_make_mask_from_slice',
 '_make_mask_from_tuple',
 '_make_wrapper',
 '_mask_selected_obj',
 '_numba_agg_general',
 '_numba_prep',
 '_obj_1d_constructor',
 '_obj_with_exclusions',
 '_positional_selector',
 '_python_agg_general',
 '_python_apply_general',
 '_reindex_output',
 '_reset_cache',
 '_reset_group_selection',
 '_resolve_numeric_only',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_set_group_selection',
 '_set_result_index_ordered',
 '_transform',
 '_transform_general',
 '_transform_item_by_item',
 '_transform_with_numba',
 '_wrap_agged_manager',
 '_wrap_aggregated_output',
 '_wrap_applied_output',
 '_wrap_applied_output_series',
 '_wrap_transform_fast_result',
 '_wrap_transformed_output',
 'agg',
 'aggregate',
 'all',
 'any',
 'apply',
 'backfill',
 'bfill',
 'boxplot',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cumcount',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'dtypes',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'get_group',
 'grade',
 'groups',
 'head',
 'hist',
 'idxmax',
 'idxmin',
 'indices',
 'last',
 'mad',
 'max',
 'mean',
 'median',
 'min',
 'ndim',
 'ngroup',
 'ngroups',
 'nth',
 'nunique',
 'ohlc',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'prod',
 'quantile',
 'rank',
 'resample',
 'rolling',
 'sample',
 'sem',
 'shift',
 'size',
 'skew',
 'std',
 'sum',
 'tail',
 'take',
 'transform',
 'tshift',
 'value_counts',
 'var',
 'y',
 'y_transform']

In [341]:
df['y_tramformed'] = g['y'].transform(np.mean)
df

  grade  y  y_transform  y_tramformed  y_transformed
0     A  3          3.0           3.0            3.0
1     B  2          2.0           2.0            2.0
2     C  4          4.0           4.0            4.0
3     D  5          5.0           5.0            5.0

In [342]:
df.groupby(['grade'])['y'].mean()

grade
A    3.0
B    2.0
C    4.0
D    5.0
Name: y, dtype: float64

In [344]:
df = pd.DataFrame({
    'grade':['A','B','C','D'],
    'y':[3,2,4,5,]
})
g= df.groupby(['grade'])
g.apply(np.mean)

C:\Users\LENOVO\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\LENOVO\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

         y
grade
A      3.0
B      2.0
C      4.0
D      5.0

In [350]:
df.iloc[[2,4,6],4]=np.nan
df

IndexError: iloc cannot enlarge its target object

In [337]:
df['y_transformed'] =g['y'].transform(np.mean)
df

  grade  y  y_transform  y_tramformed  y_transformed
0     A  3          3.0           3.0            3.0
1     B  2          2.0           2.0            2.0
2     C  4          4.0           4.0            4.0
3     D  5          5.0           5.0            5.0

In [338]:
df.groupby(["grade"])["y"].mean()

grade
A    3.0
B    2.0
C    4.0
D    5.0
Name: y, dtype: float64

In [339]:
g.apply(np.mean)

C:\Users\LENOVO\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\LENOVO\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

         y  y_transform  y_tramformed  y_transformed
grade
A      3.0          3.0           3.0            3.0
B      2.0          2.0           2.0            2.0
C      4.0          4.0           4.0            4.0
D      5.0          5.0           5.0            5.0

In [340]:
g.apply(np.mean)

C:\Users\LENOVO\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\LENOVO\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

         y  y_transform  y_tramformed  y_transformed
grade
A      3.0          3.0           3.0            3.0
B      2.0          2.0           2.0            2.0
C      4.0          4.0           4.0            4.0
D      5.0          5.0           5.0            5.0

In [ ]:
df = pd.DataFrame({})

In [312]:
g.get_group("A")

  grade  y  y_transform
0     A  3          3.0

In [322]:
g= df.groupby(['grade'])

In [318]:
g

<bound method DataFrame.groupby of   grade  y  y_transform
0     A  3          3.0
1     B  2          2.0
2     C  4          4.0
3     D  5          5.0>

In [306]:
df['y_transform']=g['y'].transform(np.mean)
df

  grade  y  y_transform
0     A  3          3.0
1     B  2          2.0
2     C  4          4.0
3     D  5          5.0

In [354]:
df.iloc[[2,4,6],3] = np.nan
df

IndexError: iloc cannot enlarge its target object

In [353]:
df= df.set_index('grade')
df

       y
grade
A      3
B      2
C      4
D      5

In [357]:
g= df.groupby(['grade'])
gt=g.transform(lambda x:x.fillna(np.mean(x)))

C:\Users\LENOVO\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\LENOVO\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\LENOVO\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\LENOVO\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

In [359]:
t= gt.groupby(('grade'))
t.mean()

         y
grade
A      3.0
B      2.0
C      4.0
D      5.0

In [360]:
gt

       y
grade
A      3
B      2
C      4
D      5

In [361]:
df

       y
grade
A      3
B      2
C      4
D      5

In [362]:
df.count()

y    4
dtype: int64

In [363]:
gt.count()

y    4
dtype: int64